zlgopen/ametal/soc/hdsc/drivers/include/rcc/hw/amhw_hc32f07x_rcc.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief
 *
 * \internal
 * \par Modification history
 * - 1.00 19-09-04  zp, first implementation
 * \endinternal
 */

#ifndef __AMHW_HC32F07X_RCC_H
#define __AMHW_HC32F07X_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_types.h"
#include "hc32f07x_regbase.h"

/*
 * \brief 匿名结构体段的开始
 */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
#elif defined(__TMS470__)
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler t
#endif

/**
 * \addtogroup amhw_hc32f07x_if_rcc
 * \copydoc amhw_hc32f07x_rcc.h
 * @{
 */

/**
 * \brief CRC寄存器块结构体
 */
typedef struct amhw_hc32f07x_rcc {
  __IO uint32_t sysctrl[3];       /**< \brief 系统控制寄存器0、1、2 */
  __IO uint32_t rch_cr;           /**< \brief 内部高速时钟控制寄存器 */
  __IO uint32_t xth_cr;           /**< \brief 外部高速时钟控制寄存器 */
  __IO uint32_t rcl_cr;           /**< \brief 内部低速时钟控制寄存器 */
  __IO uint32_t xtl_cr;            /**< \brief 外部低速时钟控制寄存器 */
  __IO uint32_t reserve0;         /**< \brief 保留位 */
  __IO uint32_t peri_clken[2];    /**< \brief 外设时钟使能寄存器 */
  __IO uint32_t reserve1[5];         /**< \brief 保留位 */
  __IO uint32_t pll_cr;           /**< \brief PLL时钟控制寄存器 */
} amhw_hc32f07x_rcc_t;

#define HC32F07X_RCCCTRL            ((amhw_hc32f07x_rcc_t *)HC32F07X_RCC_BASE)

/**
 * \brief 外设枚举
 */
typedef enum {

    /* peri_clken[0]寄存器控制的外设使能位  */
    AMHW_HC32F07X_RCC_FLASH   = 31,
    AMHW_HC32F07X_RCC_DMA     = 29,
    AMHW_HC32F07X_RCC_GPIO    = 28,
    AMHW_HC32F07X_RCC_AES     = 27,
    AMHW_HC32F07X_RCC_CRC     = 26,
    AMHW_HC32F07X_RCC_SWD     = 25,
    AMHW_HC32F07X_RCC_TICK    = 24,
    AMHW_HC32F07X_RCC_LCD     = 22,
    AMHW_HC32F07X_RCC_TRIM    = 21,
    AMHW_HC32F07X_RCC_RTC     = 20,
    AMHW_HC32F07X_RCC_PCNT    = 19,
    AMHW_HC32F07X_RCC_RNG     = 18,
    AMHW_HC32F07X_RCC_VC      = 17,
    AMHW_HC32F07X_RCC_ADC     = 16,
    AMHW_HC32F07X_RCC_WDT     = 15,
    AMHW_HC32F07X_RCC_PCA     = 14,
    AMHW_HC32F07X_RCC_OPA     = 13,
    AMHW_HC32F07X_RCC_TIM3    = 11,
    AMHW_HC32F07X_RCC_ADVTIM  = 10,
    AMHW_HC32F07X_RCC_LPTIM0  = 9,
    AMHW_HC32F07X_RCC_BASETIM = 8,
    AMHW_HC32F07X_RCC_SPI1    = 7,
    AMHW_HC32F07X_RCC_SPI0    = 6,
    AMHW_HC32F07X_RCC_I2C1    = 5,
    AMHW_HC32F07X_RCC_I2C0    = 4,
    AMHW_HC32F07X_RCC_LPUART1 = 3,
    AMHW_HC32F07X_RCC_LPUART0 = 2,
    AMHW_HC32F07X_RCC_UART1   = 1,
    AMHW_HC32F07X_RCC_UART0   = 0,

    /* peri_clken[1]寄存器控制的外设使能位  */
    AMHW_HC32F07X_RCC_UART3   = 9 + 32,
    AMHW_HC32F07X_RCC_UART2   = 8 + 32,
    AMHW_HC32F07X_RCC_I2S1    = 6 + 32,
    AMHW_HC32F07X_RCC_I2S0    = 5 + 32,
    AMHW_HC32F07X_RCC_LPTIM1  = 4 + 32,
    AMHW_HC32F07X_RCC_DAC     = 3 + 32,
    AMHW_HC32F07X_RCC_CTS     = 2 + 32,
    AMHW_HC32F07X_RCC_CAN     = 1 + 32,
    AMHW_HC32F07X_RCC_USB     = 0 + 32,
}amhw_hc32f07x_peripheral;

/**
 * \brief 系统时钟源
 */
typedef enum {
    AMHW_HC32F07X_SYSCLK_RCH = 0,   /**< \brief 内部高速时钟作为系统时钟 */
    AMHW_HC32F07X_SYSCLK_XTH,       /**< \brief 外部高速时钟作为系统时钟 */
    AMHW_HC32F07X_SYSCLK_RCL,       /**< \brief 内部低速时钟作为系统时钟 */
    AMHW_HC32F07X_SYSCLK_XTL,       /**< \brief 外部低速时钟作为系统时钟 */
    AMHW_HC32F07X_SYSCLK_PLL = 4,   /**< \brief 内部PLL作为系统时钟 */
}amhw_hc32f07x_sys_clk_src;

/**
 * \brief HCLK时钟源
 */
typedef enum {
    AMHW_HC32F07X_HCLK_SYSCLK = 0,        /**< \brief 系统时钟/1  作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV2,       /**< \brief 系统时钟/2  作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV4,       /**< \brief 系统时钟/4  作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV8,       /**< \brief 系统时钟/8  作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV16,      /**< \brief 系统时钟/16 作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV32,      /**< \brief 系统时钟/32 作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV64,      /**< \brief 系统时钟/64 作为HCLK源 */
    AMHW_HC32F07X_HCLK_SYSCLK_DIV128,     /**< \brief 系统时钟/128作为HCLK源 */
}amhw_hc32f07x_hclk_src;

/**
 * \brief PCLK时钟源
 */
typedef enum {
    AMHW_HC32F07X_PCLK_HCLK = 0,        /**< \brief HCLK时钟/1  作为PCLK源 */
    AMHW_HC32F07X_PCLK_HCLK_DIV2,       /**< \brief HCLK时钟/2  作为PCLK源 */
    AMHW_HC32F07X_PCLK_HCLK_DIV4,       /**< \brief HCLK时钟/4  作为PCLK源 */
    AMHW_HC32F07X_PCLK_HCLK_DIV8,       /**< \brief HCLK时钟/8  作为PCLK源 */
}amhw_hc32f07x_pclk_src;

/**
 * \brief SYSCTRL2 寄存器 SYSCTL0，SYSCTRL1保护系列控制寄存器，
 *
 * \param[in]  data ：写入数据
 *
 * \note 寄存器 SYSCTL0，SYSCTRL1保护系列控制寄存器，
 *       对 SYSCTRL2先写0x5A5A，再写 0xA5A5，启动对于寄存器 SYSCTL0，SYSCTRL1的写操作。
 *       只要对寄存器 SYSCTL0， SYSCTRL1写操作了，这个保护位自动回复保护状态，需要重新写入系列打开保护。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_set_start (uint16_t data)
{
	HC32F07X_RCCCTRL->sysctrl[2] = data;
}

/**
 * \brief  wakeup_byRCH  从deepsleep唤醒后，系统时钟源更换为RCH，原时钟继续使能
 *
 * \return 无
 *
 */
am_static_inline
void amhw_hc32f07x_rcc_wakeup_sysclk_rch (void)
{
	HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 15);
}

/**
 * \brief wakeup_byRCH  从deepsleep唤醒后，不改变系统时钟源
 *
 * \return 无
 *
 */
am_static_inline
void amhw_hc32f07x_rcc_wakeup_sysclk_nochange (void)
{
	HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 15);
}

/**
 * \brief PCLK_PRS PCLK时钟源切换
 *
 * \param[in]  src ：PCLK时钟源
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pclk_set (amhw_hc32f07x_pclk_src src)
{

	HC32F07X_RCCCTRL->sysctrl[0] = (HC32F07X_RCCCTRL->sysctrl[0] &
			                       ~(0x3ul << 11)) |
                                   ((src & 0x3ul) << 11);
}

/**
 * \brief HCLK_PRS HCLK时钟源切换
 *
 * \param[in]  src ：HCLK时钟源
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_hclk_set (amhw_hc32f07x_hclk_src src)
{

	HC32F07X_RCCCTRL->sysctrl[0] = (HC32F07X_RCCCTRL->sysctrl[0] &
			                       ~(0x7ul << 8)) |
                                   ((src & 0x7ul) << 8);
}

/**
 * \brief CLKSW 系统时钟源切换
 *
 * \param[in]  src ：系统时钟源
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_sys_clk_set (amhw_hc32f07x_sys_clk_src src)
{

