zlgopen/ametal/soc/hdsc/drivers/include/rcc/hw/amhw_hc32f07x_rcc.h
	HC32F07X_RCCCTRL->sysctrl[0] &= ~(0x7ul << 5);

    amhw_hc32f07x_rcc_set_start(0x5A5A);
    amhw_hc32f07x_rcc_set_start(0xA5A5);
    HC32F07X_RCCCTRL->sysctrl[0] |= (src  << 5);
}

/**
 * \brief PLL_EN PLL禁能
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 4);
}

/**
 * \brief PLL_EN PLL使能
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 4);
}

/**
 * \brief XTL_EN 外部低速晶振XTL禁能
 *
 * \note 需要将PC14、 PC15设置成模拟端口.
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 3);
}

/**
 * \brief XTL_EN 外部低速晶振XTL使能
 *
 * \note 需要将PC14、 PC15设置成模拟端口.
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 3);
}

/**
 * \brief RCL_EN 内部低速时钟RCL禁能
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rcl_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 2);
}

/**
 * \brief RCL_EN 内部低速时钟RCL使能
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rcl_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 2);
}

/**
 * \brief 获取内部低速时钟RCL是否使能
 *
 * \return 无
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_rcl_enable_get (void)
{
    return (HC32F07X_RCCCTRL->sysctrl[0] & (1ul << 2)) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief XTH_EN 外部高速晶振XTH禁能
 *
 * \note 当系统进入DeepSleep，此高速时钟会自动关闭。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 1);
}

/**
 * \brief XTH_EN 外部高速晶振XTH使能
 *
 * \note 当系统进入DeepSleep，此高速时钟会自动关闭。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 1);
}

/**
 * \brief RCH_EN 内部高速时钟RCH禁能
 *
c
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rch_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] &= ~(1ul << 0);
}

/**
 * \brief RCH_EN 内部高速时钟RCH使能
 *
 * \note 当系统进入DeepSleep，此高速时钟会自动关闭。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rch_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[0] |= (1ul << 0);
}

/**
 * \brief 获取内部高速时钟RCH是否使能
 *
 * \return 无
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_rch_enable_get (void)
{
    return (HC32F07X_RCCCTRL->sysctrl[0] & (1ul << 0)) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief USB时钟选择
 */
typedef enum {
    AMHW_HC32F07X_USBCLK_ADJUST_RCH48M = 0,    /**< \brief RCH48M */
    AMHW_HC32F07X_USBCLK_ADJUST_PLL,        /**< \brief PLL倍频时钟 */
}amhw_hc32f07x_usbclk_adjust;

/**
 * \brief USB时钟选择
 *
 * \param[in]  choice ：时钟
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_usbclk_adjust_set (amhw_hc32f07x_usbclk_adjust choice)
{
    HC32F07X_RCCCTRL->sysctrl[1] = (HC32F07X_RCCCTRL->sysctrl[1] & (~(0x1ul << 13))) |
                                 ((choice & 0x1ul) << 13);
}

/**
 * \brief RTC高速时钟补偿时钟频率选择
 */
typedef enum {
    AMHW_HC32F07X_RTCCLK_ADJUST_4M = 0,    /**< \brief 4  MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_6M,        /**< \brief 6  MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_8M,        /**< \brief 8  MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_10M,       /**< \brief 10 MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_16M,       /**< \brief 16 MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_20M,       /**< \brief 20 MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_24M,       /**< \brief 24 MHz补偿时钟频率 */
    AMHW_HC32F07X_RTCCLK_ADJUST_32M,       /**< \brief 32 MHz补偿时钟频率 */
}amhw_hc32f07x_rtcclk_adjust;

/**
 * \brief RTC_FREQ_ADJUST RTC高速时钟补偿时钟频率选择
 *
 * \param[in]  choice ：补偿时钟频率
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rtcclk_adjust_set (amhw_hc32f07x_rtcclk_adjust choice)
{
    HC32F07X_RCCCTRL->sysctrl[1] = (HC32F07X_RCCCTRL->sysctrl[1] & (~(0x7ul << 9))) |
                                 ((choice & 0x7ul) << 9);
}


/**
 * \brief SWD_USE_IO SWD端口功能配置（SWD）
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_swdio_debug (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] &= ~(1ul << 8);
}

/**
 * \brief SWD_USE_IO SWD端口功能配置（GPIO）
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_swdio_gpio (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] |= (1ul << 8);
}

/**
 * \brief LOCKUP_EN Cortex-M0+ LockUp禁能
 *
 * \note 使能后，CPU读到无效指令时会复位MCU，可增强系统可靠性。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_lockup_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] &= ~(1ul << 6);
}

/**
 * \brief LOCKUP_EN Cortex-M0+ LockUp使能
 *
 * \note 使能后，CPU读到无效指令时会复位MCU，可增强系统可靠性。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_lockup_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] |= (1ul << 6);
}

/**
 * \brief RTC_LPW RTC模块低功耗禁能
 *
 * \note 使能后， RTC模块进低功耗状态，其寄存器不可以读写。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rtc_lowpower_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] &= ~(1ul << 5);
}

/**
 * \brief RTC_LPW RTC模块低功耗使能
 *
 * \note 使能后， RTC模块进低功耗状态，其寄存器不可以读写。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rtc_lowpower_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] |= (1ul << 5);
}

/**
 * \brief XTL_ALWAYS_ON XTL高级使能控制禁能
 *
 * \note 使能后， sysctrl[0].XTL_EN只可置位。
 *       禁能后， sysctrl[0].XTL_EN可置位可清零。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_alwayson_disable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] &= ~(1ul << 3);
}

/**
 * \brief XTL_ALWAYS_ON XTL高级使能控制使能
 *
 * \note 使能后， sysctrl[0].XTL_EN只可置位。
 *       禁能后， sysctrl[0].XTL_EN可置位可清零。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_alwayson_enable (void)
{
    HC32F07X_RCCCTRL->sysctrl[1] |= (1ul << 3);
}


/**
 * \brief 外部 XTL时钟输入控制
 */
typedef enum {
    AMHW_HC32F07X_XTL_INPUT_XTAL = 0,    /**< \brief XTL输入由晶振产生 */
    AMHW_HC32F07X_XTL_INPUT_PC14,        /**< \brief XTL输入由 PC14输入 */
}amhw_hc32f07x_xtl_input;

/**
 * \brief EXTL_EN XTL时钟输入控制
 *
 * \param[in]  choice ：XTL时钟输入选择
 *
 * \note 使用PC14输入时钟时，需设置sysctrl[0].XTL_EN为1。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_input_set (amhw_hc32f07x_xtl_input choice)
{
    HC32F07X_RCCCTRL->sysctrl[1] = (HC32F07X_RCCCTRL->sysctrl[1] & (~(0x1ul << 2))) |
                                 ((choice & 0x1ul) << 2);
}

/**
 * \brief 外部 XTH时钟输入控制
 */
typedef enum {
    AMHW_HC32F07X_XTH_INPUT_XTAL = 0,    /**< \brief XTH输入由晶振产生 */
    AMHW_HC32F07X_XTH_INPUT_PF00,        /**< \brief XTH输入由PF00输入 */
}amhw_hc32f07x_xth_input;

/**
 * \brief EXTH_EN XTH时钟输入控制
 *
 * \param[in]  choice ：XTH时钟输入选择
 *
 * \note 使用PC14输入时钟时，需设置sysctrl[0].XTH_EN为1。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_input_set (amhw_hc32f07x_xth_input choice)
{
    HC32F07X_RCCCTRL->sysctrl[1] = (HC32F07X_RCCCTRL->sysctrl[1] & (~(0x1ul << 1))) |
                                 ((choice & 0x1ul) << 1);
}


/**
 * \brief stable RCH时钟稳定标志位
 *
 * \retval TRUE  : 已经稳定，可以被内部电路使用。
 * \retval FALSE : 未稳定，不可以被内部电路使用。
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_rch_state_get (void)
{
    return (am_bool_t)((HC32F07X_RCCCTRL->rch_cr & (0x1ul << 11)) ?
                       AM_TRUE :
                       AM_FALSE);
}

