zlgopen/ametal/soc/hdsc/drivers/include/rcc/hw/amhw_hc32f07x_rcc.h
typedef enum {
    AMHW_HC32F07X_RCH_FRE_24MHz = 0x00100C00,
    AMHW_HC32F07X_RCH_FRE_22MHz = 0x00100C02,   // 22.12MHz
    AMHW_HC32F07X_RCH_FRE_16MHz = 0x00100C04,
    AMHW_HC32F07X_RCH_FRE_8MHz = 0x00100C06,
    AMHW_HC32F07X_RCH_FRE_4MHz = 0x00100C08,
}amhw_hc32f07x_rch_fre_t;
/**
 * \brief TRIM 时钟频率调整
 *
 * \param[in]  data ：写入数据
 *
 * \note 时钟频率调整， Flash中保存了5组频率的校准值。
 *       将Flash内的校准值读出并写入RCH_CR.TRIM即可获得精准的频率。
 *
 *       24M校准值地址         ： 0x00100C00 - 0x00100C01
 *       22.12M校准值地址： 0x00100C02 - 0x00100C03
 *       16M校准值地址         ： 0x00100C04 - 0x00100C05
 *       8M校准值地址            ： 0x00100C06 - 0x00100C07
 *       4M校准值地址            ： 0x00100C08 - 0x00100C09
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rch_trim_set (uint16_t data)
{
    HC32F07X_RCCCTRL->rch_cr = (HC32F07X_RCCCTRL->rch_cr & (~0x07FFul)) |
                         (data & 0x07FFul);
}

/**
 * \brief TRIM 时钟频率获取
 *
 * \return 寄存器内部的时钟频率校准值
 */
am_static_inline
uint16_t amhw_hc32f07x_rcc_rch_trim_get (void)
{
    return (HC32F07X_RCCCTRL->rch_cr & 0x07FFul);
}

/**
 * \brief stable XTH时钟稳定标志位
 *
 * \retval TRUE  : 已经稳定，可以被内部电路使用。
 * \retval FALSE : 未稳定，不可以被内部电路使用。
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_xth_state_get (void)
{
    return (am_bool_t)((HC32F07X_RCCCTRL->xth_cr & (0x1ul << 6)) ?
                       AM_TRUE :
                       AM_FALSE);
}


/**
 * \brief 外部高速时钟XTH稳定时间选择
 */
typedef enum {
    AMHW_HC32F07X_XTH_WAITTIME_256 = 0,       /**< \brief 稳定时间为256个周期 */
    AMHW_HC32F07X_XTH_WAITTIME_1024,          /**< \brief 稳定时间为1024个周期 */
    AMHW_HC32F07X_XTH_WAITTIME_4096,          /**< \brief 稳定时间为4096个周期 */
    AMHW_HC32F07X_XTH_WAITTIME_16384,         /**< \brief 稳定时间为16384个周期 */
}amhw_hc32f07x_xth_waittime;

/**
 * \brief Startup 外部高速时钟XTH稳定时间选择
 *
 * \param[in]  data ：写入数据
 *
 * \note 强烈建议将 XTH 的稳定时间设置为 11（AMHW_HC32_XTH_WAITTIME_16384）。
 *       如果XTH稳定时间不足，在进行时钟切换时或从深度休眠唤醒时，系统不能稳定工作。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_waittime_set (amhw_hc32f07x_xth_waittime time_set)
{
    HC32F07X_RCCCTRL->xth_cr = (HC32F07X_RCCCTRL->xth_cr & (~(0x3ul << 4))) |
                         ((time_set & 0x3ul) << 4);
}

/**
 * \brief 外部晶振工作频率选择
 */
typedef enum {
    AMHW_HC32F07X_XTH_XTAL_FRE_4_6 = 0,       /**< \brief 4M~6M */
    AMHW_HC32F07X_XTH_XTAL_FRE_6_12,          /**< \brief 6M~12M */
    AMHW_HC32F07X_XTH_XTAL_FRE_12_20,         /**< \brief 12M~20M */
    AMHW_HC32F07X_XTH_XTAL_FRE_20_32,         /**< \brief 20M~32M */
}amhw_hc32f07x_xth_xtal_fre;

/**
 * \brief xth_fsel 外部晶振工作频率选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_xtal_fre_set (amhw_hc32f07x_xth_xtal_fre fre)
{
    HC32F07X_RCCCTRL->xth_cr = (HC32F07X_RCCCTRL->xth_cr & (~(0x3ul << 2))) |
                         ((fre & 0x3ul) << 2);
}

/**
 * \brief 外部晶振驱动能力选择
 */
typedef enum {
    AMHW_HC32F07X_XTH_XTAL_DRIVER_MIN = 0,       /**< \brief 最弱驱动能力 */
    AMHW_HC32F07X_XTH_XTAL_DRIVER_SMALL,         /**< \brief 弱驱动能力 */
    AMHW_HC32F07X_XTH_XTAL_DRIVER_DEFAULT,       /**< \brief 默认驱动能力 (推荐值) */
    AMHW_HC32F07X_XTH_XTAL_DRIVER_MAX,           /**< \brief 最强驱动能力 */
}amhw_hc32f07x_xth_xtal_driver;

/**
 * \brief Driver 外部晶振驱动能力选择
 *
 * \param[in]  data ：写入数据
 *
 * \note 需要根据晶振特性、负载电容以及电路板的寄生参数选择适当的驱动能力。
 *       驱动能力越大则功耗越大；驱动能力越弱则功耗越小。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xth_xtal_driver_set (amhw_hc32f07x_xth_xtal_driver driver_set)
{
    HC32F07X_RCCCTRL->xth_cr = (HC32F07X_RCCCTRL->xth_cr & (~(0x3ul << 0))) |
                             ((driver_set & 0x3ul) << 0);
}

/**
 * \brief stable RCL时钟稳定标志位
 *
 * \retval TRUE  : 已经稳定，可以被内部电路使用。
 * \retval FALSE : 未稳定，不可以被内部电路使用。
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_rcl_state_get (void)
{
    return (am_bool_t)((HC32F07X_RCCCTRL->rcl_cr & (0x1ul << 12)) ?
                       AM_TRUE :
                       AM_FALSE);
}

/**
 * \brief 内部低速时钟RCL稳定时间选择
 */
typedef enum {
    AMHW_HC32F07X_RCL_WAITTIME_4 = 0,       /**< \brief 稳定时间为4个周期 */
    AMHW_HC32F07X_RCL_WAITTIME_16,          /**< \brief 稳定时间为16个周期 */
    AMHW_HC32F07X_RCL_WAITTIME_64,          /**< \brief 稳定时间为64个周期 */
    AMHW_HC32F07X_RCL_WAITTIME_256,         /**< \brief 稳定时间为256个周期 */
}amhw_hc32f07x_rcl_waittime;

/**
 * \brief Startup 内部低速时钟RCL稳定时间选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rcl_waittime_set (amhw_hc32f07x_rcl_waittime time_set)
{
    HC32F07X_RCCCTRL->rcl_cr = (HC32F07X_RCCCTRL->rcl_cr & (~(0x3ul << 10))) |
                             ((time_set & 0x3ul) << 10);
}

typedef enum {
    AMHW_HC32F07X_RCl_FRE_38400Hz = 0x00100C20,
    AMHW_HC32F07X_RCl_FRE_32768Hz = 0x00100C22,
}amhw_hc32f07x_rcl_fre_t;

/**
 * \brief TRIM 时钟频率调整
 *
 * \param[in]  data ：写入数据
 *
 * \note 内部低速时钟频率调整， Flash中保存了2组频率的校准值。
 *       将Flash内的校准值读出并写入RCL_CR.TRIM即可获得精准的频率。
 *
 *       38.4K校准值地址      ： 0x00100C20 - 0x00100C21
 *       32.768K校准值地址： 0x00100C22 - 0x00100C23
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_rcl_trim_set (uint16_t data)
{
    HC32F07X_RCCCTRL->rcl_cr = (HC32F07X_RCCCTRL->rcl_cr & (~0x03FFul)) |
                         (data & 0x03FFul);
}

/**
 * \brief TRIM 时钟频率获取
 *
 * \return 寄存器内部的时钟频率校准值
 */
am_static_inline
uint16_t amhw_hc32f07x_rcc_rcl_trim_get (void)
{
    return (HC32F07X_RCCCTRL->rcl_cr & 0x07FFul);
}

/**
 * \brief stable XTL时钟稳定标志位
 *
 * \retval TRUE  : 已经稳定，可以被内部电路使用。
 * \retval FALSE : 未稳定，不可以被内部电路使用。
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_xtl_state_get (void)
{
    return (am_bool_t)((HC32F07X_RCCCTRL->xtl_cr & (0x1ul << 6)) ?
                       AM_TRUE :
                       AM_FALSE);
}

/**
 * \brief 内部低速时钟RCL稳定时间选择
 */
typedef enum {
    AMHW_HC32F07X_XTL_WAITTIME_256 = 0,       /**< \brief 稳定时间为256个周期 */
    AMHW_HC32F07X_XTL_WAITTIME_1024,          /**< \brief 稳定时间为1024个周期 */
    AMHW_HC32F07X_XTL_WAITTIME_4096,          /**< \brief 稳定时间为4096个周期 */
    AMHW_HC32F07X_XTL_WAITTIME_16384,         /**< \brief 稳定时间为16384个周期 */
}amhw_hc32f07x_xtl_waittime;

/**
 * \brief Startup 内部低速时钟XTL稳定时间选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_waittime_set (amhw_hc32f07x_xtl_waittime time_set)
{
    HC32F07X_RCCCTRL->xtl_cr = (HC32F07X_RCCCTRL->xtl_cr & (~(0x3ul << 4))) |
                             ((time_set & 0x3ul) << 4);
}

/**
 * \brief XTL晶振振荡幅度的调整
 */
typedef enum {
    AMHW_HC32F07X_XTL_XTAL_AMPLITUDE_MIN = 0,       /**< \brief 最小振幅 */
    AMHW_HC32F07X_XTL_XTAL_AMPLITUDE_NORMAL,        /**< \brief 正常振幅 */
    AMHW_HC32F07X_XTL_XTAL_AMPLITUDE_BIG_DEFAULT,   /**< \brief 较大振幅（推荐值） */
    AMHW_HC32F07X_XTL_XTAL_AMPLITUDE_MAX,           /**< \brief 最大振幅 */
}amhw_hc32f07x_xtl_xtal_amplitude;

/**
 * \brief Driver XTL晶振振荡幅度的调整
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_xtal_amplitude_set (amhw_hc32f07x_xtl_xtal_amplitude driver_set)
{
    HC32F07X_RCCCTRL->xtl_cr = (HC32F07X_RCCCTRL->xtl_cr & (~(0x3ul << 2))) |
                             ((driver_set & 0x3ul) << 2);
}

/**
 * \brief 外部晶振驱动能力选择
 */
typedef enum {
    AMHW_HC32F07X_XTL_XTAL_DRIVER_MIN = 0,       /**< \brief 最弱驱动能力 */
    AMHW_HC32F07X_XTL_XTAL_DRIVER_DEFAULT,       /**< \brief 一般驱动能力 （推荐值） */
    AMHW_HC32F07X_XTL_XTAL_DRIVER_BIG,           /**< \brief 较强驱动能力 */
    AMHW_HC32F07X_XTL_XTAL_DRIVER_MAX,           /**< \brief 最强驱动能力 */
}amhw_hc32f07x_xtl_xtal_driver;

/**
 * \brief Driver 外部低速晶振驱动能力选择
 *
 * \param[in]  data ：写入数据
 *
 * \note 需要根据晶振特性、负载电容以及电路板的寄生参数选择适当的驱动能力。
 *       驱动能力越大则功耗越大；驱动能力越弱则功耗越小。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_xtl_xtal_driver_set (amhw_hc32f07x_xtl_xtal_driver driver_set)
{
    HC32F07X_RCCCTRL->xtl_cr = (HC32F07X_RCCCTRL->xtl_cr & (~(0x3ul << 0))) |
                             ((driver_set & 0x3ul) << 0);
}

/**
 * \brief stable PLL稳定标志
 *
 * \retval TRUE  : 已经稳定，可以被内部电路使用。
 * \retval FALSE : 未稳定，不可以被内部电路使用。
 */
am_static_inline
am_bool_t amhw_hc32f07x_rcc_pll_state_get (void)
{
    return (am_bool_t)((HC32F07X_RCCCTRL->pll_cr & (0x1ul << 18)) ?
                       AM_TRUE :
                       AM_FALSE);
}

/**
 * \brief PLL稳定时间选择
 */
typedef enum {
    AMHW_HC32F07X_PLL_WAITTIME_128 = 0,      /**< \brief 稳定时间为128个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_256,          /**< \brief 稳定时间为256个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_512,          /**< \brief 稳定时间为512个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_1024,         /**< \brief 稳定时间为1024个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_2048,         /**< \brief 稳定时间为2048个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_4096,         /**< \brief 稳定时间为4096个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_8192,         /**< \brief 稳定时间为8192个周期 */
    AMHW_HC32F07X_PLL_WAITTIME_16384,        /**< \brief 稳定时间为16384个周期 */
}amhw_hc32f07x_pll_waittime;

/**
 * \brief Startup PLL稳定时间选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_waittime_set (amhw_hc32f07x_pll_waittime time_set)
{
    HC32F07X_RCCCTRL->pll_cr = (HC32F07X_RCCCTRL->pll_cr & (~(0x7ul << 15))) |
                         ((time_set & 0x7ul) << 15);
}

/**
 * \brief PLL输入频率选择
 */
typedef enum {
    AMHW_HC32F07X_PLL_INPUT_FRE_4_6 = 0,       /**< \brief 4M~6M */
    AMHW_HC32F07X_PLL_INPUT_FRE_6_12,          /**< \brief 6M~12M */
    AMHW_HC32F07X_PLL_INPUT_FRE_12_20,         /**< \brief 12M~20M */
    AMHW_HC32F07X_PLL_INPUT_FRE_20_24,         /**< \brief 20M~32M */
}amhw_hc32f07x_pll_input_fre;

/**
 * \brief FRSEL PLL输入频率选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_input_fre_set (amhw_hc32f07x_pll_input_fre fre)
{
    HC32F07X_RCCCTRL->pll_cr = (HC32F07X_RCCCTRL->pll_cr & (~(0x3ul << 13))) |
                             ((fre & 0x3ul) << 13);
}

/**
 * \brief DIVN PLL输出时钟的倍频系数
 *
 * \param[in]  data ：写入数据, 允许范围0X2~0XC
 *
 * \note 输出频率 = DIVN*输入频率，
 *       data 允许范围0X2~0XC
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_divn_set (uint8_t data)
{
    HC32F07X_RCCCTRL->pll_cr = (HC32F07X_RCCCTRL->pll_cr & (~(0xful << 5))) |
                             ((data & 0xful) << 5);
}

/**
 * \brief PLL输出频率范围选择
 */
typedef enum {
    AMHW_HC32F07X_PLL_OUTPUT_FRE_8_12 = 0,      /**< \brief 8M~12M  */
    AMHW_HC32F07X_PLL_OUTPUT_FRE_12_18,         /**< \brief 12M~18M */
    AMHW_HC32F07X_PLL_OUTPUT_FRE_18_24,         /**< \brief 18M~24M */
    AMHW_HC32F07X_PLL_OUTPUT_FRE_24_36,         /**< \brief 24M~36M */
    AMHW_HC32F07X_PLL_OUTPUT_FRE_36_48,         /**< \brief 36M~48M */
}amhw_hc32f07x_pll_output_fre;

/**
 * \brief FOSC PLL输出频率范围选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_output_fre_set (amhw_hc32f07x_pll_output_fre fre)
{
    HC32F07X_RCCCTRL->pll_cr = (HC32F07X_RCCCTRL->pll_cr & (~(0x7ul << 2))) |
                             ((fre & 0x7ul) << 2);
}

/**
 * \brief PLL输入时钟选择
 */
typedef enum {
    AMHW_HC32F07X_PLL_INPUT_FRE_SRC_XTH_XTAL = 0,   /**< \brief XTH晶振生成的时钟  */
    AMHW_HC32F07X_PLL_INPUT_FRE_SRC_XTH_PF00 = 1,   /**< \brief XTH从管脚PF00输入的时钟 */
    AMHW_HC32F07X_PLL_INPUT_FRE_SRC_RCH      = 3,   /**< \brief RCH时钟 */
}amhw_hc32f07x_pll_input_fre_src;

/**
 * \brief FRSEL PLL输入时钟选择
 *
 * \param[in]  data ：写入数据
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f07x_rcc_pll_input_fre_src_set (amhw_hc32f07x_pll_input_fre_src fre)
{
    HC32F07X_RCCCTRL->pll_cr = (HC32F07X_RCCCTRL->pll_cr & (~0x3ul)) |
                             (fre & 0x3ul);
}

/**
 * \brief 使能外设
 *
 * \param[in]  peri ：需要使能的外设
 *
 * \return 无
 *
 */
void amhw_hc32f07x_rcc_peripheral_enable (amhw_hc32f07x_peripheral peri);

/**
 * \brief 检查某外设时钟是否使能
 *
 * \param[in]  peri ：需要使能的外设
 *
 * \return 1: 当前外设时钟已使能，无需再次使能
 *         0: 当前外设时钟未使能
 *
 */
int amhw_hc32f07x_rcc_peripheral_enable_check (amhw_hc32f07x_peripheral peri);

/**
 * \brief 禁能外设
 *
 * \param[in]  peri ：需要禁能的外设
 *
 * \return 无
 *
 */
void amhw_hc32f07x_rcc_peripheral_disable (amhw_hc32f07x_peripheral peri);

/**
 * @}
 */
/*
 * \brief 匿名结构体段的结束
 */

#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
#elif defined(__GNUC__)
#elif defined(__TMS470__)
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler t
#endif

#ifdef __cplusplus
}
#endif /* __HC32f07x_RCC_H */

#endif

/* end of file */
